ДомПласт_локальная_база/src/DataProcessors/Панель1СWebKassa/Панель1СWebKassa.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Панель1СWebKassa</name>
</mdclass:DataProcessor>

ДомПласт_локальная_база/src/Catalogs/НастройкиИнтеграцииWebKassa/НастройкиИнтеграцииWebKassa.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиИнтеграцииWebKassa</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияWebKassa</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ДомПласт_локальная_база/src/DataProcessors/Панель1СWebKassa/Forms/СменаАдресаСервиса/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Организация") Тогда
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	
	Организация = Параметры.Организация;
	ТекущийАдресСервиса = ИнтеграцияWebKassaВызовСервера.АдресСервиса(Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьСменуАдреса(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзменитьАдресСервиса(Организация, НовыйАдресСервиса) Тогда
		РезультатВыбора = Новый Структура("РезультатВыполнения", Истина);
		Закрыть(РезультатВыбора);
	Иначе
		ТекстСообщения = НСтр("ru = 'При изменении адреса сервиса произошла ошибка.
			|(Подробности см. в Журнале регистрации).'");
		
		ИнтеграцияWebKassaКлиентПереопределяемый.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ИзменитьАдресСервиса(Организация, НовыйАдресСервиса) Экспорт
	
	Возврат Справочники.НастройкиИнтеграцииWebKassa.ИзменитьАдресСервиса(Организация, НовыйАдресСервиса);
	
КонецФункции

#КонецОбласти
